src/InformationRegisters/ИсторияВызовов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияВызовов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаправлениеВызова</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНаправленияВызова</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходящийЗвонок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПользовательSip</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоВызова</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРазговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеЗвонка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗвонка</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>URLЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятДругимАбонентомГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОбработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОбрабатывающего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникЗвонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПривлечения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоллтрекингНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнутреннийНомерСотрудника</Name>
					<Comment>Добавочный номер для ITOOLABSE</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РекламныйИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопытокПолученияФайлаЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатыОбработкиЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыОбработкиЗвонка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОборудованиеТелефонии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDЗвонка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоциальнаяСеть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КороткийАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Координаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексОтзывы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ТелефонныеАппараты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ТелефонныеАппараты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПривязанКСотрудникам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрослушатьЗаписьРазговоров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментСотрудников</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыПривязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/IPТелефонияКлиент/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция - Исходящий звонок осуществить по контрагенту
// 
// Параметры:
//  Контрагент		 - 	 - 
//  НомерТелефонаКонтрагента	 - 	 - 
//  ОписаниеОшибки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Процедура ИсходящийЗвонокОсуществитьПоКонтрагенту(Контрагент = Неопределено, НомерТелефонаКонтрагента = Неопределено, ОписаниеОшибки = "") Экспорт
	
	Сотрудник = ОбщегоНазначенияСтоматология.ПолучитьЗначениеПараметровСеанса("ТекущийСотрудник");
	
	IPТелефонияОборудование = Неопределено;
	мМассивДоступныхУстройств = МенеджерОборудованияВызовСервера.ПолучитьСписокОборудования("IPТелефония");
	НомерТелефонаКонтрагент = ?(ЗначениеЗаполнено(НомерТелефонаКонтрагента), НомерТелефонаКонтрагента, Контрагент);
	
	ПараметрыОповещения = Новый Структура("IPТелефонияОборудование, Сотрудник, НомерТелефонаКонтрагент, Контрагент, ОписаниеОшибки", IPТелефонияОборудование, Сотрудник, НомерТелефонаКонтрагент, Контрагент, ОписаниеОшибки);
	
	МассивДоступныхУстройств = Новый Массив;
	
	Если мМассивДоступныхУстройств.Количество() >= 2 Тогда
		
		СтруктурнаяЕдиница = ОбщегоНазначения.ТекущаяСтруктурнаяЕдиница();
		
		Для Каждого СтрокаМ из мМассивДоступныхУстройств Цикл
			Если Не СтрокаМ.Параметры = Неопределено И СтрокаМ.Параметры.Свойство("СтруктурнаяЕдиница") Тогда
				Если  СтрокаМ.Параметры.СтруктурнаяЕдиница = СтруктурнаяЕдиница Тогда
					Если СтрокаМ.ОбработчикДрайвера <> ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсCallTouch") Тогда  
						МассивДоступныхУстройств.Добавить(СтрокаМ);
					КонецЕсли;
				КонецЕсли;				
			Иначе
				МассивДоступныхУстройств.Добавить(СтрокаМ);
			КонецЕсли;			
		КонецЦикла		
	Иначе	
		МассивДоступныхУстройств = мМассивДоступныхУстройств;
	КонецЕсли;
	
	Если МассивДоступныхУстройств.Количество() = 0 Тогда
		ОписаниеОшибки = "Не обнаружено подключаемое оборудование IP-телефонии!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Возврат;
	ИначеЕсли МассивДоступныхУстройств.Количество() = 1 Тогда
		ПараметрыОповещения.IPТелефонияОборудование = МассивДоступныхУстройств[0].Ссылка;
	ИначеЕсли МассивДоступныхУстройств.Количество() >= 2 Тогда
		СписокДоступныхУстройств = Новый СписокЗначений;
		Для каждого ЭлементТЧ Из МассивДоступныхУстройств Цикл
			СписокДоступныхУстройств.Добавить(ЭлементТЧ, ЭлементТЧ.Наименование);
		КонецЦикла; 
		Оповещение = Новый ОписаниеОповещения("ИсходящийЗвонокОсуществитьПоКонтрагентуЗавершение", ЭтотОбъект, ПараметрыОповещения);
		ОткрытьФорму("ОбщаяФорма.ВыборИзСписка", Новый Структура("Заголовок, СписокЗначений", "Выберите устройство IP-телефонии", СписокДоступныхУстройств),,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
	КонецЕсли;
	
	ИсходящийЗвонокОсуществитьПоКонтрагентуЗавершение(Новый Структура("Ссылка", ПараметрыОповещения.IPТелефонияОборудование), ПараметрыОповещения);	
	
КонецПроцедуры

Процедура ИсходящийЗвонокОсуществитьПоКонтрагентуЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	Иначе
		Параметры.IPТелефонияОборудование = Результат.Ссылка;
	КонецЕсли;
	
	Если ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизитаПоПути(Параметры.IPТелефонияОборудование, "ДрайверОборудования.ОбработчикДрайвера") = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВедисофтПростыеЗвонки") Тогда
		// Получение номера телефона сотрудника
		МассивТелефонныхАппаратовСотрудника = IPТелефония.ПолучитьСтруктуруВнутреннегоНомераПоПользователю(Параметры.Сотрудник);
		Если МассивТелефонныхАппаратовСотрудника.Количество() = 0 Тогда
			ОписаниеОшибки = "Менеджер '" + Параметры.Сотрудник + "' не в сети или внутренний номер телефона не зарегистрирован.";
			Возврат;
		ИначеЕсли Не ЗначениеЗаполнено(МассивТелефонныхАппаратовСотрудника[0].НомерТелефона) Тогда
			ОписаниеОшибки = "Внутренний номер телефона на менеджера '" + Параметры.Сотрудник + "' не зарегистрирован.";
			Возврат;			
		КонецЕсли;
		
		РезультатКоманды = ПростыеЗвонки_ИсходящийЗвонокОсуществить(МассивТелефонныхАппаратовСотрудника[0].НомерТелефона, Параметры.НомерТелефонаКонтрагент, Параметры.ОписаниеОшибки);
	Иначе
		РезультатКоманды = IPТелефония.ИсходящийЗвонокОсуществить(Параметры.IPТелефонияОборудование, Параметры.Сотрудник, Параметры.НомерТелефонаКонтрагент, Параметры.Сотрудник, Параметры.Контрагент, Параметры.ОписаниеОшибки);
	КонецЕсли;

	Если РезультатКоманды <> Истина И ЗначениеЗаполнено(Параметры.ОписаниеОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Параметры.ОписаниеОшибки);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПереадресацияЗвонкаОбработкаОповещения(мПараметры) Экспорт
	
	ОткрытьФорму("Справочник.ТелефонныеАппараты.Форма.ФормаПереадресации", мПараметры, , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОткрытьСписокПропущенныхЗвонков(ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Вставить("ОтборПериод"							, Новый СтандартныйПериод(ВариантСтандартногоПериода.Сегодня));
	ДополнительныеПараметры.Вставить("ОтборТипЗвонка"						, 2);			
	ДополнительныеПараметры.Вставить("ОтобразитьПользовательскийВидФормы"	, Истина);		
	ОткрытьФорму("РегистрСведений.ИсторияВызовов.ФормаСписка", ДополнительныеПараметры, , ДополнительныеПараметры.КлючОповещения);
	
КонецПроцедуры

Процедура СоздатьНовогоКлиентаОповещение(Параметры) Экспорт
		
	Телефон                 = Параметры.НомерТелефона;
	XML_Телефон				= УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Телефон, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКлиента"));
	Представление_Телефон 	= УправлениеКонтактнойИнформациейСлужебныйВызовСервера.СтрокаСоставаКонтактнойИнформации(XML_Телефон); 
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("ТелефонКлиента"			, Представление_Телефон); 
	ФормаЭлементаКонтакт = ПолучитьФорму("Справочник.Контрагенты.Форма.ФормаЭлементаКлиенты", , , "IPТелефония_СоздатьПотенциальногоКлиента_" + Телефон);
	МассивСтрокТелефона = ФормаЭлементаКонтакт.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон")));
	НоваяСтрока		= ?(МассивСтрокТелефона.Количество() > 0, МассивСтрокТелефона[0], ФормаЭлементаКонтакт.КонтактнаяИнформация.Добавить());
	НоваяСтрока.Тип	= ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
	НоваяСтрока.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКлиента");
	НоваяСтрока.Представление = Телефон;
	НоваяСтрока.ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Телефон, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКлиента"));
	ФормаЭлементаКонтакт.Модифицированность = Истина;
	
	ФормаЭлементаКонтакт.Открыть();
	
КонецПроцедуры

Процедура ОткрытьФормуЗвонкаОповещение(Параметры) Экспорт
	
	ОткрытьФорму("РегистрСведений.ИсторияВызовов.Форма.ФормаЗвонокКлиента", Параметры,, Параметры.IDЗвонка);
	
КонецПроцедуры

// Процедура - При начале работы системы
// 
Процедура ПриНачалеРаботыСистемы(ПараметрыРаботыКлиента) Экспорт
	
	Если ПараметрыРаботыКлиента.Свойство("НачальноеЗаполнениеДанных") 
		И Не ПараметрыРаботыКлиента.НачальноеЗаполнениеДанных Тогда 
		Если (ПараметрыРаботыКлиента.Свойство("РазделениеВключено") И ПараметрыРаботыКлиента.РазделениеВключено)
			И НЕ(ПараметрыРаботыКлиента.Свойство("ДоступноИспользованиеРазделенныхДанных") И ПараметрыРаботыКлиента.ДоступноИспользованиеРазделенныхДанных) Тогда
			Возврат;
		КонецЕсли;	    
		
		Если IPТелефония.ПроверитьВозможностьЗвонкаНаДанномПК() Тогда
			
			ПодключитьОбработчикОжидания("ОбработчикОжиданияОбновитьПоследнююАктивность", 10, Истина);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область РосТелеком

// Функция - Получить актуальный URLЗаписи ROSTELECOMКлиент
//
// Параметры:
//  ИсходныйURLЗаписи	 - 	 - 
//  IDЗвонка			 - 	 - 
//  ПОIPТелефонии		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьАктуальныйURLЗаписиROSTELECOMКлиент(Знач ИсходныйURLЗаписи, Знач IDЗвонка, Знач ПОIPТелефонии) Экспорт
		
	Если Не IPТелефония.ЭтоОбработчикДрайвераПереданнойПОIPТелефонии(ПОIPТелефонии, ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсROSTELECOM")) Тогда
		Возврат ИсходныйURLЗаписи;
	КонецЕсли;		
	
	ВнешнийIPКлиента = ПолучитьВнешнийIPАдресКлиент();
	
	Если Не ЗначениеЗаполнено(ВнешнийIPКлиента) Тогда
		Возврат ИсходныйURLЗаписи;
	КонецЕсли;
	
	Возврат IPТелефония.ПолучитьАктуальныйURLЗаписиROSTELECOMСервер(ИсходныйURLЗаписи, IDЗвонка, ВнешнийIPКлиента);
	
КонецФункции

// Функция - Получить внешний IP-Адрес.
// 
Функция ПолучитьВнешнийIPАдресКлиент() Экспорт
	
	IPАдрес = "";
	#Если Не ВебКлиент Тогда
	Попытка
		
		// http://ip-api.com/json/
		Соединение = Новый HTTPСоединение("ip-api.com");
		HTTPЗапрос = Новый HTTPЗапрос("json");				
		
		РезультатЗапроса = Соединение.Получить(HTTPЗапрос);
		РезультатЗапроса = РазобратьJsonКлиент(РезультатЗапроса);
		
		Если РезультатЗапроса.Свойство("status") И РезультатЗапроса.status = "success"
			И РезультатЗапроса.Свойство("query") И ЗначениеЗаполнено(РезультатЗапроса.query) Тогда
			
			IPАдрес = РезультатЗапроса.query
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	#КонецЕсли
	Возврат IPАдрес;
	
КонецФункции

// Функция - Разобрать параметры JSON.
//
Функция РазобратьJsonКлиент(Запрос)
	#Если Не ВебКлиент Тогда
	Попытка
		
		ТекстJSON  = Запрос.ПолучитьТелоКакСтроку();
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		
		Возврат ПрочитатьJSON(ЧтениеJSON);
		
	Исключение
		
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Ошибка: %1. Исходный текст JSON: %2';en= 'Error: %1. Source text JSON: %2'"), ОписаниеОшибки(), ТекстJSON);
		
	КонецПопытки;
	#КонецЕсли
КонецФункции

#КонецОбласти

#Область ПростыеЗвонки

&НаКлиенте
// Процедура - При изменения состояния подключения
// 
// Параметры:
//  Статус	 - 	 - 
// 
Процедура ПриИзмененияСостоянияПодключения(Статус)
	
	Оповестить("ПростыеЗвонки_ИзменилосьСостояние",Статус);
	
КонецПроцедуры

// Функция - Тестирование сервера
// 
// Параметры:
//  ТипыПодключаемогоОборудования	 - 	 - 
//  Сервер							 - 	 - 
//  Порт							 - 	 - 
//  Логин							 - 	 - 
//  Пароль							 - 	 - 
//  ОписаниеОшибки					 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПоддержкаАсинхронногоРежима() Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Функция - Тестирование сервера
// 
// Параметры:
//  ТипыПодключаемогоОборудования	 - 	 - 
//  Сервер							 - 	 - 
//  Порт							 - 	 - 
//  Логин							 - 	 - 
//  Пароль							 - 	 - 
//  ОписаниеОшибки					 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПодключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт

#Если НЕ МобильныйКлиент Тогда	
	
	ВыходныеПараметры = Новый Массив;
	// Если не подключен телефонный аппарат к рабочему месту то не подключаем (жрет лицензии);
	ВозможностьЗвонка = IPТелефония.ПростыеЗвонки_ПроверитьВозможностьЗвонкаНаДанномПК(Истина);
	Если Не ВозможностьЗвонка Тогда 
		ВыходныеПараметры.Добавить("");
		ВыходныеПараметры.Добавить("На данном рабочем месте нет возможности осуществлять звонки");
		Возврат Ложь;
	КонецЕсли;
			
	ОшибкиСоответствие = Новый Соответствие;
	ОшибкиСоответствие.Вставить(0, "Нет соединения");
	ОшибкиСоответствие.Вставить(2, "Лицензия истекла");
	ОшибкиСоответствие.Вставить(3, "Превышен лимит клиентов");
	ОшибкиСоответствие.Вставить(4, "Второе подключение пользователя");
		
	ПОПЫТКА
		
		НомерШага = 1; // Создание КОМ объекта для отправки запроса
		
		МассивТелефонныхАппаратовСотрудника = IPТелефония.ПолучитьСтруктуруВнутреннегоНомераПоПользователю(ОбщегоНазначенияСтоматология.ПолучитьЗначениеПараметровСеанса("ТекущийПользователь"), ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВедисофтПростыеЗвонки"));
		
		Если КомпонентаПростыеЗвонки = Неопределено Тогда				
			КомпонентаПростыеЗвонки = Новый Структура();		
			
			Для Каждого СтрокаТЧ Из МассивТелефонныхАппаратовСотрудника Цикл 		
								
				COMОбъектПростыеЗвонки = Новый COMОбъект("CTIControlX.CTIControlX");
				
				ДобавитьОбработчик COMОбъектПростыеЗвонки.OnConnectionState,		ПриИзмененияСостоянияПодключения;
				ДобавитьОбработчик COMОбъектПростыеЗвонки.OnTransferRequest,		ПереадресоватьВходящийЗвонок;
				ДобавитьОбработчик COMОбъектПростыеЗвонки.OnCompletedCall,			ПриЗавершенииЗвонка;
				ДобавитьОбработчик COMОбъектПростыеЗвонки.OnTransferredCall,		ОбработатьВходящийЗвонок;
				ДобавитьОбработчик COMОбъектПростыеЗвонки.OnOutcomingCall,			ОбработатьИсходящийЗвонок;
				ДобавитьОбработчик COMОбъектПростыеЗвонки.OnOutcomingCallAnswer,	ОбработатьОтветНаИсходящийЗвонок;
				ДобавитьОбработчик COMОбъектПростыеЗвонки.OnTransferredCallAnswer,  ОбработатьОтветНаВходящийЗвонок;		
								
				Если ЗначениеЗаполнено(СтрокаТЧ.НомерТелефона) Тогда				
					COMОбъектПростыеЗвонки.PhoneNumber = Строка(СтрокаТЧ.НомерТелефона);				
				КонецЕсли;
				
				ИдентификаторБазы1С = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПростыеЗвонки", "ИдентификаторБазы1С",,, "ПростыеЗвонки");
				
				Если ИдентификаторБазы1С <> Неопределено Тогда
					COMОбъектПростыеЗвонки.BroadcastGroup = ИдентификаторБазы1С;
				КонецЕсли; 
				
				// Идентификатор должен начинаться с нижнего подчерка или буквы!!!
				
				КомпонентаПростыеЗвонки.Вставить("_" + СтрЗаменить(СтрокаТЧ.Оборудование.УникальныйИдентификатор(), "-", ""), COMОбъектПростыеЗвонки);
				
			КонецЦикла;   	
			
		КонецЕсли;
		
		НомерШага = 2; // Отправка XML запроса на сервер и получение ответа 		
		Если Параметры = Неопределено Тогда
			
			ПОIPТелефонии = IPТелефония.ОпределитьПодключаемоеОборудование(ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВедисофтПростыеЗвонки"));
			Если Не ЗначениеЗаполнено(ПОIPТелефонии) Тогда
				ВыходныеПараметры.Добавить("");
				ВыходныеПараметры.Добавить("Number is not registred");			
				Возврат Ложь;
			КонецЕсли;
			Параметры = ПОIPТелефонии.Параметры.Получить();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.Сервер) = Ложь Тогда
			ВызватьИсключение "Ошибка! Необходимо произвести настройки сервера IP-телефонии в подключаемом оборудовании.";
		КонецЕсли;		
		
		АвторизованныйПользователь = Пользователи.АвторизованныйПользователь();
		УИД = СокрЛП(Строка(АвторизованныйПользователь.УникальныйИдентификатор()));
		
		Для Каждого СтрокаТЧ Из МассивТелефонныхАппаратовСотрудника Цикл
			
			ПараметрыОборудования = IPТелефония.ПолучитьПараметрыОборудования(СтрокаТЧ.оборудование);		
			Пароль = ?(ЗначениеЗаполнено(ПараметрыОборудования.Пароль), ПараметрыОборудования.Пароль, Неопределено);
			
			КлючТелефонии = "_" + СтрЗаменить(СтрокаТЧ.Оборудование.УникальныйИдентификатор(), "-", "");
			
			Если КомпонентаПростыеЗвонки[КлючТелефонии].connectionState <> 1 Тогда
				КомпонентаПростыеЗвонки[КлючТелефонии].Connect(ПараметрыОборудования.Сервер, Пароль, "1C", УИД, "", 0, 5000); 			
			КонецЕсли;
		
			Если ЗначениеЗаполнено(КомпонентаПростыеЗвонки[КлючТелефонии].errorBuffer) Тогда // КомпонентаПростыеЗвонки.connectionState <> 1 Тогда
				ОписаниеОшибки = ?(ОшибкиСоответствие.Получить(КомпонентаПростыеЗвонки[КлючТелефонии].connectionState) <> Неопределено,
				Строка(ОшибкиСоответствие.Получить(КомпонентаПростыеЗвонки[КлючТелефонии].connectionState)), КомпонентаПростыеЗвонки[КлючТелефонии].errorBuffer);
				ВыходныеПараметры.Добавить("");
				ВыходныеПараметры.Добавить(ОписаниеОшибки);			
				Возврат Ложь;
			КонецЕсли;
			
		КонецЦикла; 
		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		ВыходныеПараметры.Добавить("");
		ВыходныеПараметры.Добавить(ОписаниеОшибки);					
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
#КонецЕсли

КонецФункции

Функция ПростыеЗвонки_ПолучитьВерсиюКомпоненты(КлючТелефонии = Неопределено) Экспорт
	
	Версия = Неопределено;
	
	Попытка
		
		Если КомпонентаПростыеЗвонки = Неопределено Тогда
			IPТелефонияКлиент.ПодключитьУстройство(Неопределено, Неопределено, Неопределено, Неопределено);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КлючТелефонии) Тогда	
			Попытка
				Версия = КомпонентаПростыеЗвонки[КлючТелефонии].activeXVersion();
			Исключение
				Версия = Неопределено;
			КонецПопытки;
		КонецЕсли;
		
	Исключение
		
	КонецПопытки;
	
	Возврат Версия;
	
КонецФункции

Функция ПростыеЗвонки_ПолучитьНомерПоследнейВерсии() Экспорт
	
	АктуальнаяВерсияActiveX = Неопределено;
	ИмяФайла = КаталогВременныхФайлов()+"CTI_version.xml";
	
	Попытка
		Соединение = Новый HTTPСоединение("prostiezvonki.ru");
		Соединение.Получить("version.xml", ИмяФайла);
		
		Чтение = Новый ЧтениеXML;
		Чтение.ОткрытьФайл(ИмяФайла);
		Чтение.Прочитать();
		
	Исключение
		Возврат АктуальнаяВерсияActiveX;
		
	КонецПопытки;
	
	Пока Чтение.Прочитать() Цикл
		Если Чтение.ПолучитьАтрибут("Name") = "CTIControl_1C" Тогда
			АктуальнаяВерсияActiveX = Чтение.ПолучитьАтрибут("Version");
		КонецЕсли;
	КонецЦикла;
	
	Возврат АктуальнаяВерсияActiveX;
	
КонецФункции

Функция ПростыеЗвонки_ИсходящийЗвонокОсуществить(ПользовательSip, НомерТелефона, ОписаниеОшибки = "") Экспорт
	
	Попытка
		
		Если КомпонентаПростыеЗвонки = Неопределено Тогда
			IPТелефонияКлиент.ПодключитьУстройство(Неопределено, Неопределено, Неопределено, Неопределено);
		КонецЕсли;
		
		НомерТелефонаПриведенный = ОбщегоНазначенияКлиентСервер.ВернутьПриведенныйНомер_ПростыеЗвонки(НомерТелефона);
		
		МассивТелефонныхАппаратовСотрудника = IPТелефония.ПолучитьСтруктуруВнутреннегоНомераПоПользователю(ОбщегоНазначенияСтоматология.ПолучитьЗначениеПараметровСеанса("ТекущийПользователь"));
		
		Для Каждого СтрокаТЧ Из МассивТелефонныхАппаратовСотрудника Цикл
			
			КлючТелефонии = "_" + СтрЗаменить(СтрокаТЧ.Оборудование.УникальныйИдентификатор(), "-", "");
			
			Если КомпонентаПростыеЗвонки.Свойство(КлючТелефонии) Тогда 
				КомпонентаПростыеЗвонки[КлючТелефонии].Call(ПользовательSip, НомерТелефонаПриведенный);
			КонецЕсли;
		
		КонецЦикла;
	
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ИнформацияОбОшибке.Описание + ?(ИнформацияОбОшибке.Причина <> Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		
	КонецПопытки;
	
КонецФункции

Процедура ПереадресоватьВходящийЗвонок(callID, from, line)
	
	ОписаниеОшибки = "";
	Если line="from_internal" Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЛичныйМенеджер = IPТелефония.ПолучитьЛичногоМенеджераДляПереадресации(СокрЛП(from), ОписаниеОшибки);
	Если ТипЗнч(СтруктураЛичныйМенеджер) = Тип("Структура") И ЗначениеЗаполнено(СтруктураЛичныйМенеджер.НомерТелефона) Тогда
		
		МассивТелефонныхАппаратовСотрудника = IPТелефония.ПолучитьСтруктуруВнутреннегоНомераПоПользователю(ОбщегоНазначенияСтоматология.ПолучитьЗначениеПараметровСеанса("ТекущийПользователь"));
		
		Для Каждого СтрокаТЧ Из МассивТелефонныхАппаратовСотрудника Цикл
			
			КлючТелефонии = "_" + СтрЗаменить(СтрокаТЧ.Оборудование.УникальныйИдентификатор(), "-", "");
			
			Если КомпонентаПростыеЗвонки.Свойство(КлючТелефонии) Тогда 
				КомпонентаПростыеЗвонки[КлючТелефонии].Transfer(callID, СтруктураЛичныйМенеджер.НомерТелефона);
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьВходящийЗвонок(callID, src, dst, line)
	
	ОписаниеОшибки = "";
	ПОIPТелефонии = IPТелефония.ОпределитьПодключаемоеОборудование(ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВедисофтПростыеЗвонки"));
	Если line="from_internal" Тогда
		Возврат;
	КонецЕсли;
	
	IPТелефония.ПростыеЗвонки_СобытиеЗвонок(ПОIPТелефонии, "IncomingCall", Новый Структура("callID, ExternalNumber, InternalNumber", callID, src, dst), ОписаниеОшибки);
	
КонецПроцедуры

Процедура ОбработатьОтветНаВходящийЗвонок(callID, src, dst, line)
	
	ОписаниеОшибки = "";
	ПОIPТелефонии = IPТелефония.ОпределитьПодключаемоеОборудование(ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВедисофтПростыеЗвонки"));
	Если line="from_internal" Тогда
		Возврат;
	КонецЕсли;	
	
	IPТелефония.ПростыеЗвонки_СобытиеЗвонок(ПОIPТелефонии, "IncomingCallTalkStart", Новый Структура("callID, ExternalNumber, InternalNumber", callID, src, dst), ОписаниеОшибки);
	
КонецПроцедуры

Процедура ОбработатьИсходящийЗвонок(callID, src, dst)
	
	ОписаниеОшибки = "";
	ПОIPТелефонии = IPТелефония.ОпределитьПодключаемоеОборудование(ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВедисофтПростыеЗвонки"));
	
	IPТелефония.ПростыеЗвонки_СобытиеЗвонок(ПОIPТелефонии, "OutgoingCall", Новый Структура("callID, ExternalNumber, InternalNumber", callID, src, dst), ОписаниеОшибки);
	
КонецПроцедуры

Процедура ОбработатьОтветНаИсходящийЗвонок(callID, src, dst)
	
	ОписаниеОшибки = "";
	ПОIPТелефонии = IPТелефония.ОпределитьПодключаемоеОборудование(ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВедисофтПростыеЗвонки"));
	
	IPТелефония.ПростыеЗвонки_СобытиеЗвонок(ПОIPТелефонии, "OutgoingCallTalkStart", Новый Структура("callID, ExternalNumber, InternalNumber", callID, src, dst), ОписаниеОшибки);
	
КонецПроцедуры

Процедура ПриЗавершенииЗвонка(callID, src, dst, duration, start, end, direction, record, line)
	
	ОписаниеОшибки = "";
	ИмяФункции = ?(direction = 0, "IncomingCallCompleted", "OutgoingCallCompleted");
	ПОIPТелефонии = IPТелефония.ОпределитьПодключаемоеОборудование(ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВедисофтПростыеЗвонки"));
	
	IPТелефония.ПростыеЗвонки_СобытиеЗвонок(ПОIPТелефонии, ИмяФункции, 
	Новый Структура("callID, ExternalNumber, InternalNumber, Start, End, Duration, URLRecord", 
	callID, src, dst, start, end, duration, record),
	ОписаниеОшибки);
	
КонецПроцедуры

Функция ПростыеЗвонкиПолучитьСостояние() Экспорт
	
	Если КомпонентаПростыеЗвонки = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	МассивТелефонныхАппаратовСотрудника = IPТелефония.ПолучитьСтруктуруВнутреннегоНомераПоПользователю(ОбщегоНазначенияСтоматология.ПолучитьЗначениеПараметровСеанса("ТекущийПользователь"));
	
	Для Каждого СтрокаТЧ Из МассивТелефонныхАппаратовСотрудника Цикл
		
		КлючТелефонии = "_" + СтрЗаменить(СтрокаТЧ.Оборудование.УникальныйИдентификатор(), "-", "");
		
		Если КомпонентаПростыеЗвонки.Свойство(КлючТелефонии) Тогда 
			
			Попытка
				Состояние = КомпонентаПростыеЗвонки[КлючТелефонии].connectionState;
			Исключение
				Состояние = 0;
				ПоказатьПредупреждение(, "Не удалось получить состояние компоненты Простые звонки");
			КонецПопытки;			
			Возврат Состояние;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура ПростыеЗвонкиОтключиться() Экспорт
	
	МассивТелефонныхАппаратовСотрудника = IPТелефония.ПолучитьСтруктуруВнутреннегоНомераПоПользователю(ОбщегоНазначенияСтоматология.ПолучитьЗначениеПараметровСеанса("ТекущийПользователь"));
	
	Для Каждого СтрокаТЧ Из МассивТелефонныхАппаратовСотрудника Цикл
		
		КлючТелефонии = "_" + СтрЗаменить(СтрокаТЧ.Оборудование.УникальныйИдентификатор(), "-", "");
		
		Если КомпонентаПростыеЗвонки.Свойство(КлючТелефонии) Тогда 
			
			Попытка
				КомпонентаПростыеЗвонки[КлючТелефонии].Disconnect();
			Исключение
				ПоказатьПредупреждение(, "Не удалось отключить компоненту Простые звонки");
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти
